In [2]:
# Para no tener que reiniciar el kernel
#%load_ext autoreload
#%autoreload 2

# Importaciones
import pandas as pd
import numpy as np
from datetime import datetime

#Seteo de opciones
pd.set_option("display.max_columns", None)

In [3]:
import matplotlib.pyplot as plt
import seaborn as sns

### Hacemos la descarga de datos de los dos archivos (bank y customer)

In [4]:
customer_2012 = pd.read_excel("../data/data_raw/customer-details.xlsx",sheet_name = '2012', index_col=0)
customer_2013 = pd.read_excel("../data/data_raw/customer-details.xlsx",sheet_name = '2013', index_col=0)
customer_2014 = pd.read_excel("../data/data_raw/customer-details.xlsx",sheet_name = '2014', index_col=0)

In [5]:
customer_2012.shape

(20115, 6)

In [6]:
customer_2013.shape

(8965, 6)

In [7]:
customer_2014.shape

(14090, 6)

In [8]:
df_customer = pd.concat([customer_2012, customer_2013, customer_2014], axis=0, ignore_index=True)

In [25]:
df_bank = pd.read_csv("../data/data_raw/bank-additional.csv", index_col=0)

### Verificamos el tamaño de ambos df

In [10]:
print(f"El tamaño del dataset clientes es de {df_customer.shape[0]} filas y {df_customer.shape[1]} filas")

El tamaño del dataset clientes es de 43170 filas y 6 filas

In [11]:
print(f"El tamaño del dataset clientes es de {df_bank.shape[0]} filas y {df_bank.shape[1]} filas")

El tamaño del dataset clientes es de 43000 filas y 23 filas

### Estandarizamos los nombres de columnas

In [12]:
df_customer.columns = df_customer.columns.str.lower()
df_customer.columns

Index(['income', 'kidhome', 'teenhome', 'dt_customer', 'numwebvisitsmonth',
       'id'],
      dtype='object')

In [38]:
df_bank.columns = df_bank.columns.str.replace("_","").str.lower().str.replace(".","_")
df_bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp_var_rate', 'cons_price_idx', 'cons_conf_idx', 'euribor3m',
       'nr_employed', 'y', 'date', 'latitude', 'longitude', 'id'],
      dtype='object')

## Análisis inicial df_customer

In [39]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43170 entries, 0 to 43169
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   income             43170 non-null  int64
 1   kidhome            43170 non-null  int64
 2   teenhome           43170 non-null  int64
 3   dt_customer        43170 non-null  datetime64[ns]
 4   numwebvisitsmonth  43170 non-null  int64
 5   id                 43170 non-null  object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 2.0+ MB

In [40]:
df_customer.describe().T

,count,mean,min,25%,50%,75%,max,std
income,43170.0,93227.389622,5841.0,49608.0,93009.5,136740.5,180802.0,50498.181989
kidhome,43170.0,1.004749,0.0,0.0,1.0,2.0,2.0,0.815996
teenhome,43170.0,0.998633,0.0,0.0,1.0,2.0,2.0,0.816008
dt_customer,43170,2013-05-11 22:09:47.407922176,2012-01-01 00:00:00,2012-07-16 00:00:00,2013-03-01 00:00:00,2014-03-28 00:00:00,2014-12-31 00:00:00,NaN
numwebvisitsmonth,43170.0,16.59129,1.0,9.0,17.0,25.0,32.0,9.241769

In [41]:
df_customer.describe(include='O')

                                          id
count                                  43170
unique                                 43170
top     089b39d8-e4d0-461b-87d4-814d71e0e079
freq                                       1

In [17]:
df_customer["dt_customer"] = pd.to_datetime(df_customer["dt_customer"],format = "%m/%d/%Y" )   
df_customer.head()

,income,kidhome,teenhome,dt_customer,numwebvisitsmonth,id
0,161770,1,0,2012-04-04,29,089b39d8-e4d0-461b-87d4-814d71e0e079
1,85477,1,1,2012-12-30,7,e9d37224-cb6f-4942-98d7-46672963d097
2,147233,1,1,2012-02-02,5,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,121393,1,2,2012-12-21,29,9991fafb-4447-451a-8be2-b0df6098d13e
4,63164,1,2,2012-06-20,20,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

### Comprobamos presencia de nulos

In [18]:
df_customer.isnull().sum()

income               0
kidhome              0
teenhome             0
dt_customer          0
numwebvisitsmonth    0
id                   0
dtype: int64

### Comprobamos duplicados en el df y en la columna id

In [19]:
df_customer.duplicated().sum()

np.int64(0)

In [20]:
df_customer.duplicated(["id"]).sum()

np.int64(0)

In [21]:
df_customer.columns

Index(['income', 'kidhome', 'teenhome', 'dt_customer', 'numwebvisitsmonth',
       'id'],
      dtype='object')

In [22]:
df_customer["kidhome"].unique()

array([1, 0, 2])

## Preanálisis df_bank

### info()

In [42]:
df_bank.sample(3)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp_var_rate,cons_price_idx,cons_conf_idx,euribor3m,nr_employed,y,date,latitude,longitude,id
23742,31.0,admin.,DIVORCED,high.school,0.0,0.0,0.0,cellular,12,10,999,0,NONEXISTENT,1.4,"93,444","-36,1","4,962","5228,1",no,26-diciembre-2019,45.660,-74.464,c97c1826-34a5-40bc-810e-436c47cf5647
6360,52.0,services,MARRIED,high.school,0.0,0.0,0.0,telephone,145,5,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857",5191,no,8-diciembre-2017,35.335,-87.581,e479e5a4-b24c-497c-af1f-b16c4fc58323
27285,NaN,housemaid,MARRIED,basic.4y,0.0,1.0,0.0,cellular,66,1,999,0,NONEXISTENT,-0.1,"93,2",-42,"4,021","5195,8",no,13-diciembre-2016,29.008,-84.830,d8232347-7f48-41d2-898e-a051076851b2

In [43]:
df_bank.info()

<class 'pandas.core.frame.DataFrame'>
Index: 43000 entries, 0 to 27570
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             37880 non-null  float64
 1   job             42655 non-null  object
 2   marital         42915 non-null  object
 3   education       41193 non-null  object
 4   default         34019 non-null  float64
 5   housing         41974 non-null  float64
 6   loan            41974 non-null  float64
 7   contact         43000 non-null  object
 8   duration        43000 non-null  int64
 9   campaign        43000 non-null  int64
 10  pdays           43000 non-null  int64
 11  previous        43000 non-null  int64
 12  poutcome        43000 non-null  object
 13  emp_var_rate    43000 non-null  float64
 14  cons_price_idx  42529 non-null  object
 15  cons_conf_idx   43000 non-null  object
 16  euribor3m       33744 non-null  object
 17  nr_employed     43000 non-null  object
 18  y               43000 non-null  object
 19  date            42752 non-null  object
 20  latitude        43000 non-null  float64
 21  longitude       43000 non-null  float64
 22  id              43000 non-null  object
dtypes: float64(7), int64(4), object(12)
memory usage: 7.9+ MB

### Conclusiones .info()

- Tenemos varias columas con nulos:
  - age
  - job
  - marital
  - education
  - default
  - housing
  - loan
  - cons.price.idx
  - euribor3m
  - date

- Columnas en las que habría que revisar/cambiar el tipo de dato
  - cons.price.idx -> object, coma en los decimales
  - cons.conf.idx -> object, coma en los decimales
  - euribor3m -> object, coma en los decimales
  - nr.employed -> object, coma en los decimales
  - date -> object, formato con el mes en texto

In [45]:
df_bank.describe().T

,count,mean,std,min,25%,50%,75%,max
age,37880.0,39.977112,10.437957,17.000,32.00000,38.0000,47.00000,98.000
default,34019.0,0.000088,0.009390,0.000,0.00000,0.0000,0.00000,1.000
housing,41974.0,0.535998,0.498708,0.000,0.00000,1.0000,1.00000,1.000
loan,41974.0,0.155620,0.362499,0.000,0.00000,0.0000,0.00000,1.000
duration,43000.0,257.739279,258.666033,0.000,102.00000,179.0000,319.00000,4918.000
campaign,43000.0,2.567233,2.772294,1.000,1.00000,2.0000,3.00000,56.000
pdays,43000.0,962.330953,187.260394,0.000,999.00000,999.0000,999.00000,999.000
previous,43000.0,0.174023,0.497366,0.000,0.00000,0.0000,0.00000,7.000
emp_var_rate,43000.0,0.077128,1.573898,-3.400,-1.80000,1.1000,1.40000,1.400
latitude,43000.0,36.856697,7.225948,24.396,30.61475,36.7610,43.11325,49.384
longitude,43000.0,-95.939067,16.752282,-124.997,-110.49425,-95.8995,-81.42775,-66.937

### Observaciones .describe()

- Varias columnas con sólo valores 0 y 1 (default, housing, load) tienen tipo float y parecen ser booleanos
- columna pdays con valores maximos que no parecen coherentes, 999 dias como maximo no tiene sentido, revisar

In [44]:
df_bank.describe(include='O').T

                count unique                                   top   freq
job             42655     11                                admin.  10873
marital         42915      3                               MARRIED  25999
education       41193      7                     university.degree  12722
contact         43000      2                              cellular  27396
poutcome        43000      3                           NONEXISTENT  37103
cons_price_idx  42529     26                                93,994   7938
cons_conf_idx   43000     26                                 -36,4   8020
euribor3m       33744    309                                 4,857   2287
nr_employed     43000     11                                5228,1  16980
y               43000      2                                    no  38156
date            42752   1825                       28-febrero-2018     95
id              43000  43000  089b39d8-e4d0-461b-87d4-814d71e0e079      1

In [ ]:
df_nulos = round(df_bank.isnull().sum() / len(df_bank) * 100, 2)
df_nulos

### Valores unicos de df_bank

In [ ]:
bank_columnas = df_bank.columns.tolist()
bank_columnas

In [48]:
for col in bank_columnas:
     print(f"Columna {col.upper()}:\n")
     print(f"Valores únicos: {df_bank[col].unique()}\n")
     print(f"Conteo de valores únicos:\n{df_bank[col].value_counts()}")
     print("_____________________________________")

Columna AGE:

Valores únicos: [nan 57. 37. 40. 56. 45. 59. 24. 25. 41. 29. 35. 54. 50. 39. 30. 55. 46.
 49. 34. 52. 58. 32. 38. 44. 42. 60. 51. 48. 47. 31. 33. 53. 43. 36. 28.
 27. 26. 22. 20. 23. 21. 61. 19. 18. 70. 66. 76. 67. 73. 88. 95. 68. 75.
 63. 80. 62. 72. 82. 64. 71. 69. 78. 65. 85. 79. 77. 83. 81. 74. 17. 87.
 91. 86. 98. 94. 84. 92. 89.]

Conteo de valores únicos:
age
31.0    1810
33.0    1704
32.0    1672
36.0    1649
34.0    1608
        ...
91.0       2
98.0       2
95.0       1
87.0       1
94.0       1
Name: count, Length: 78, dtype: int64
_____________________________________
Columna JOB:

Valores únicos: ['housemaid' 'services' 'admin.' 'blue-collar' 'technician' 'retired'
 'management' 'unemployed' 'self-employed' nan 'entrepreneur' 'student']

Conteo de valores únicos:
job
admin.           10873
blue-collar       9654
technician        7026
services          4162
management        3050
retired           1790
entrepreneur      1522
self-employed     1489
housemaid         1123
unemployed        1063
student            903
Name: count, dtype: int64
_____________________________________
Columna MARITAL:

Valores únicos: ['MARRIED' 'SINGLE' 'DIVORCED' nan]

Conteo de valores únicos:
marital
MARRIED     25999
SINGLE      12105
DIVORCED     4811
Name: count, dtype: int64
_____________________________________
Columna EDUCATION:

Valores únicos: ['basic.4y' 'high.school' 'basic.6y' 'basic.9y' 'professional.course' nan
 'university.degree' 'illiterate']

Conteo de valores únicos:
education
university.degree      12722
high.school             9925
basic.9y                6309
professional.course     5477
basic.4y                4356
basic.6y                2386
illiterate                18
Name: count, dtype: int64
_____________________________________
Columna DEFAULT:

Valores únicos: [ 0. nan  1.]

Conteo de valores únicos:
default
0.0    34016
1.0        3
Name: count, dtype: int64
_____________________________________
Columna HOUSING:

Valores únicos: [ 0.  1. nan]

Conteo de valores únicos:
housing
1.0    22498
0.0    19476
Name: count, dtype: int64
_____________________________________
Columna LOAN:

Valores únicos: [ 0.  1. nan]

Conteo de valores únicos:
loan
0.0    35442
1.0     6532
Name: count, dtype: int64
_____________________________________
Columna CONTACT:

Valores únicos: ['telephone' 'cellular']

Conteo de valores únicos:
contact
cellular     27396
telephone    15604
Name: count, dtype: int64
_____________________________________
Columna DURATION:

Valores únicos: [ 261  149  226 ... 1246 1556 1868]

Conteo de valores únicos:
duration
90      183
136     177
85      177
73      172
111     170
       ...
1416      1
1603      1
1361      1
2219      1
1048      1
Name: count, Length: 1540, dtype: int64
_____________________________________
Columna CAMPAIGN:

Valores únicos: [ 1  2  3  4  5  6  7  8  9 10 11 12 13 19 18 23 14 22 25 16 17 15 20 56
 39 35 42 28 26 27 32 21 24 29 31 30 41 37 40 33 34 43]

Conteo de valores únicos:
campaign
1     18404
2     11048
3      5584
4      2777
5      1658
6      1025
7       658
8       418
9       289
10      236
11      183
12      130
13       94
14       73
17       61
16       51
15       51
18       34
20       30
19       26
21       26
23       20
24       18
22       17
27       11
29       10
30       10
28        8
31        8
25        8
26        8
35        5
33        4
32        4
34        3
43        2
40        2
42        2
39        1
56        1
37        1
41        1
Name: count, dtype: int64
_____________________________________
Columna PDAYS:

Valores únicos: [999   6   4   3   5   1   0  10   7   8   9  11   2  12  13  14  15  16
  21  17  18  22  25  26  19  27  20]

Conteo de valores únicos:
pdays
999    41412
3        457
6        428
4        121
9         67
7         66
2         63
12        61
10        55
5         50
13        38
11        30
15        26
1         26
14        22
8         20
0         15
16        13
17        10
18         7
22         4
19         3
21         2
25         1
26         1
27         1
20         1
Name: count, dtype: int64
_____________________________________
Columna PREVIOUS:

Valores únicos: [0 1 2 3 4 5 6 7]

Conteo de valores únicos:
previous
0    37103
1     4778
2      786
3      232
4       75
5       20
6        5
7        1
Name: count, dtype: int64
_____________________________________
Columna POUTCOME:

Valores únicos: ['NONEXISTENT' 'FAILURE' 'SUCCESS']

Conteo de valores únicos:
poutcome
NONEXISTENT    37103
FAILURE         4461
SUCCESS         1436
Name: count, dtype: int64
_____________________________________
Columna EMP_VAR_RATE:

Valores únicos: [ 1.1  1.4 -0.1 -0.2 -1.8 -2.9 -3.4 -3.  -1.7 -1.1]

Conteo de valores únicos:
emp_var_rate
 1.4    16980
-1.8     9620
 1.1     8020
-0.1     3830
-2.9     1748
-3.4     1133
-1.7      812
-1.1      665
-3.0      181
-0.2       11
Name: count, dtype: int64
_____________________________________
Columna CONS_PRICE_IDX:

Valores únicos: ['93,994' nan '94,465' '93,918' '93,444' '93,798' '93,2' '92,756' '92,843'
 '93,075' '92,893' '92,963' '92,469' '92,201' '92,379' '92,431' '92,649'
 '92,713' '93,369' '93,749' '93,876' '94,055' '94,215' '94,027' '94,199'
 '94,601' '94,767']

Conteo de valores únicos:
cons_price_idx
93,994    7938
93,918    6937
92,893    5985
93,444    5349
94,465    4522
93,2      3731
93,075    2552
92,201     803
92,963     742
92,431     471
92,649     375
94,215     320
94,199     316
92,843     298
92,379     274
93,369     271
94,027     242
94,055     236
93,876     224
94,601     212
92,469     184
92,713     179
93,749     179
94,767     130
93,798      48
92,756      11
Name: count, dtype: int64
_____________________________________
Columna CONS_CONF_IDX:

Valores únicos: ['-36,4' '-41,8' '-42,7' '-36,1' '-40,4' '-42' '-45,9' '-50' '-47,1'
 '-46,2' '-40,8' '-33,6' '-31,4' '-29,8' '-26,9' '-30,1' '-33' '-34,8'
 '-34,6' '-40' '-39,8' '-40,3' '-38,3' '-37,5' '-49,5' '-50,8']

Conteo de valores únicos:
cons_conf_idx
-36,4    8020
-42,7    7004
-46,2    6057
-36,1    5408
-41,8    4568
-42      3782
-47,1    2581
-31,4     815
-40,8     748
-26,9     477
-30,1     379
-40,3     328
-37,5     318
-50       299
-29,8     277
-34,8     275
-38,3     245
-39,8     239
-40       225
-49,5     214
-33,6     185
-34,6     183
-33       181
-50,8     133
-40,4      48
-45,9      11
Name: count, dtype: int64
_____________________________________
Columna EURIBOR3M:

Valores únicos: ['4,857' nan '4,856' '4,855' '4,859' '4,86' '4,858' '4,864' '4,865'
 '4,866' '4,967' '4,961' '4,959' '4,958' '4,96' '4,962' '4,955' '4,947'
 '4,956' '4,966' '4,963' '4,957' '4,968' '4,97' '4,965' '4,964' '5,045'
 '4,936' '4,921' '4,918' '4,912' '4,827' '4,794' '4,76' '4,733' '4,7'
 '4,663' '4,592' '4,474' '4,406' '4,343' '4,286' '4,245' '4,223' '4,191'
 '4,153' '4,12' '4,076' '4,021' '3,901' '3,879' '3,853' '3,743' '3,563'
 '3,488' '3,428' '3,329' '3,282' '3,053' '1,811' '1,799' '1,778' '1,757'
 '1,726' '1,703' '1,687' '1,663' '1,65' '1,64' '1,629' '1,614' '1,602'
 '1,584' '1,56' '1,556' '1,548' '1,538' '1,531' '1,52' '1,51' '1,498'
 '1,483' '1,479' '1,466' '1,453' '1,445' '1,435' '1,423' '1,415' '1,41'
 '1,405' '1,406' '1,4' '1,392' '1,384' '1,372' '1,365' '1,354' '1,344'
 '1,334' '1,327' '1,313' '1,299' '1,291' '1,281' '1,266' '1,25' '1,244'
 '1,259' '1,264' '1,27' '1,262' '1,26' '1,268' '1,286' '1,252' '1,235'
 '1,224' '1,215' '1,206' '1,099' '1,085' '1,072' '1,059' '1,048' '1,044'
 '1,029' '1,018' '0,996' '0,979' '0,969' '0,944' '0,937' '0,933' '0,921'
 '0,914' '0,908' '0,884' '0,883' '0,881' '0,879' '0,873' '0,869' '0,861'
 '0,859' '0,854' '0,851' '0,849' '0,843' '0,838' '0,834' '0,829' '0,825'
 '0,821' '0,819' '0,813' '0,809' '0,803' '0,797' '0,788' '0,781' '0,778'
 '0,773' '0,771' '0,77' '0,768' '0,766' '0,762' '0,755' '0,749' '0,743'
 '0,741' '0,739' '0,75' '0,753' '0,754' '0,752' '0,744' '0,74' '0,742'
 '0,737' '0,735' '0,733' '0,73' '0,731' '0,728' '0,724' '0,722' '0,72'
 '0,719' '0,716' '0,715' '0,714' '0,718' '0,721' '0,717' '0,712' '0,71'
 '0,709' '0,708' '0,706' '0,707' '0,7' '0,655' '0,654' '0,653' '0,652'
 '0,651' '0,65' '0,649' '0,646' '0,644' '0,643' '0,639' '0,637' '0,635'
 '0,636' '0,634' '0,638' '0,64' '0,642' '0,645' '0,659' '0,663' '0,668'
 '0,672' '0,677' '0,682' '0,683' '0,684' '0,685' '0,688' '0,69' '0,692'
 '0,695' '0,697' '0,699' '0,701' '0,702' '0,704' '0,711' '0,713' '0,723'
 '0,727' '0,729' '0,732' '0,748' '0,761' '0,767' '0,782' '0,79' '0,793'
 '0,802' '0,81' '0,822' '0,827' '0,835' '0,84' '0,846' '0,87' '0,876'
 '0,885' '0,889' '0,893' '0,896' '0,899' '0,898' '0,9' '0,904' '0,905'
 '0,903' '0,895' '0,894' '0,891' '0,89' '0,888' '0,886' '0,882' '0,88'
 '0,878' '0,877' '0,942' '0,953' '0,956' '0,959' '0,965' '0,972' '0,977'
 '0,982' '0,985' '0,987' '0,993' '1' '1,008' '1,016' '1,025' '1,032'
 '1,037' '1,043' '1,047' '1,05' '1,049' '1,046' '1,041' '1,04' '1,039'
 '1,035' '1,03' '1,031' '1,028']

Conteo de valores únicos:
euribor3m
4,857    2287
4,962    2124
4,963    2019
4,961    1594
4,964     964
         ...
5,045       1
4,921       1
0,895       1
0,956       1
0,953       1
Name: count, Length: 309, dtype: int64
_____________________________________
Columna NR_EMPLOYED:

Valores únicos: ['5191' '5228,1' '5195,8' '5176,3' '5099,1' '5076,2' '5017,5' '5023,5'
 '5008,7' '4991,6' '4963,6']

Conteo de valores únicos:
nr_employed
5228,1    16980
5099,1     8937
5191       8020
5195,8     3830
5076,2     1748
5017,5     1133
4991,6      812
5008,7      683
4963,6      665
5023,5      181
5176,3       11
Name: count, dtype: int64
_____________________________________
Columna Y:

Valores únicos: ['no' 'yes']

Conteo de valores únicos:
y
no     38156
yes     4844
Name: count, dtype: int64
_____________________________________
Columna DATE:

Valores únicos: ['2-agosto-2019' '14-septiembre-2016' '15-febrero-2019' ... '28-mayo-2016'
 '22-abril-2015' '7-marzo-2015']

Conteo de valores únicos:
date
28-febrero-2018      95
28-febrero-2016      94
28-febrero-2015      92
28-febrero-2017      89
28-febrero-2019      85
                     ..
17-diciembre-2018    11
21-diciembre-2019    10
14-abril-2015        10
4-abril-2017         10
20-noviembre-2015    10
Name: count, Length: 1825, dtype: int64
_____________________________________
Columna LATITUDE:

Valores únicos: [41.495 34.601 34.939 ... 38.147 40.679 27.772]

Conteo de valores únicos:
latitude
44.675    10
36.826     9
30.579     8
44.335     8
32.888     8
          ..
28.986     1
47.455     1
45.137     1
34.651     1
32.875     1
Name: count, Length: 20491, dtype: int64
_____________________________________
Columna LONGITUDE:

Valores únicos: [ -71.233  -83.923  -94.847 ... -120.015 -117.518 -105.026]

Conteo de valores únicos:
longitude
-80.000     6
-84.358     6
-101.604    6
-88.922     6
-105.981    6
           ..
-109.835    1
-70.852     1
-85.121     1
-90.902     1
-85.811     1
Name: count, Length: 30448, dtype: int64
_____________________________________
Columna ID:

Valores únicos: ['089b39d8-e4d0-461b-87d4-814d71e0e079'
 'e9d37224-cb6f-4942-98d7-46672963d097'
 '3f9f49b5-e410-4948-bf6e-f9244f04918b' ...
 'cadadd4b-7ee5-4019-b13a-ca01bb67ca5b'
 '5f432048-d515-4bb5-9c94-62db451f88d4'
 '993bbbd6-4dbc-4a40-a408-f91f8462bee6']

Conteo de valores únicos:
id
089b39d8-e4d0-461b-87d4-814d71e0e079    1
e9d37224-cb6f-4942-98d7-46672963d097    1
3f9f49b5-e410-4948-bf6e-f9244f04918b    1
9991fafb-4447-451a-8be2-b0df6098d13e    1
eca60b76-70b6-4077-80ba-bc52e8ebb0eb    1
                                       ..
4eed05de-2a98-4227-b488-32122009b638    1
0f0aca88-4088-4fe2-905f-44fb675d9493    1
cadadd4b-7ee5-4019-b13a-ca01bb67ca5b    1
5f432048-d515-4bb5-9c94-62db451f88d4    1
993bbbd6-4dbc-4a40-a408-f91f8462bee6    1
Name: count, Length: 43000, dtype: int64
_____________________________________

### Observaciones valores únicos y nulos

- **age**
  - Las 5 edades mas repetidas son 31, 32, 33, 34 y 36 sin grandes diferencias entre ellas
  - Hay un 11.91% de nulos
- **job**
  - admin. con 10873 y blue-collar con 9654 diferenciados del resto
  - 0.80% de nulos
- **marital**
  - 4 valores únicos ('MARRIED' 'SINGLE' 'DIVORCED' nan)
  - MARRIED el más destacado, dobla en cantidad al siguiente
  - 0.20% de nulos
- **education**
  - 7 valores únicos (university.degree, high.school, basic.9y, professional.course, basic.4y, basic.6y, illiterate)
  - university.degree el más destacado con 12722 registros
  - illiterate solo tiene 18 registros?
  - 4.20% de nulos
- **default**
  - 3 valores únicos (0. nan  1.)
  - 0 valor principal, 1 solo 3 registros
  - 20.89% de nulos
- **housing**
  - 3 valores únicos (0. nan  1.)
  - poca diferencia entre valores 0 y 1
  - 2.39% de nulos
- **loan**
  - 3 valores únicos (0. nan  1.)
  - 0 con 29000 registros mas que 1
  - 2.39% de nulos 
- **contact**
  - 2 valores únicos ('telephone' 'cellular')
  - mayor presencia de cellular, muy diferenciado de relephone
- **dutation**
  - 5 valores mas destacados (90, 136, 85, 73, 111)
  -con registros entre 170 y 183
- **campaign**
  - los valores mas destacados son 1 y 2 contactos
  - bastante diferenciados de los siguientes valores
- **pdays**
  - valor más destacado 999 (no tiene sentido) con 41412 registros
- **previous**
  - valor de contactos más destacado es 0 con 37103
  - siguiente es 1 con 4778
- **poutcome**
  - 3 valores únicos ('NONEXISTENT' 'FAILURE' 'SUCCESS')
  - destaca NONEXISTENT con 16980
- **emp_var_rate**
  - 10 valores únicos
  - el más destacado es 1.4 con 16980 registros
- **cons_price_idx** 
  - sin valores que destaquen 
  - 1.10 % de nulos
- **cons_conf_idx** 
  - sin valores que destaquen
- **euribor3m**
  - sin valores que destaquen
  - 21.53% de nulos
- **nr_employed**
  - parece ser número de empleado, no numero de empleados
  - destaca notablemente 5228.1 (no tiene sentido los decimales)
- **y**
  - 2 valores unicos, no y yes
  - destaca no con 36156 registros   
- **date**
  - sin valores que destaquen
  - 0.58% de nulos
- **latitude**, **longitude** 
  - som valores significativos
- **id**
  - sin nulos ni valores que se repitan más de una vez

### Comprobacion de duplicados

In [50]:
df_bank.duplicated().sum()

np.int64(0)

Sin presencia de duplicados